#include <stdio.h>
void main()
{

    /************************
 산술 연산자
************************/

    int x, y;
    x = 10;
    y = 3;
    printf("x + y=%d\n", x + y);
    printf("x / y=%d\n", x / y);
    printf("x %% y=%d\n", x % y);
    printf("y %% x=%d\n", y % x);
    // ‘%’문자를 출력하기 위해 %문자를 2개 연속 사용

    /************************
 ++, -- 연산자
************************/

    int a, b;
    x = 5;
    a = ++x * x--; // x는 6으로 계산됨
    b = x * 10;    // 여기서 x는 5
    printf("a=%d b=%d x=%d\n", a, b, x);

    /************************
 관계 연산자
************************/
    printf("\n# 관계 연산자\n");

    int c, d;
    a = 4, b;

    b = a > 2;
    printf("b = %d\n", b); // 1
    c = a < 2;
    printf("c = %d\n", c); // 0
    d = a == 4;
    printf("d = %d\n", d); // 1

    /************************
 논리 연산자
************************/
    printf("\n# 논리 연산자\n");

    int e;
    a = 4, b = 7, c, d;
    c = a > 2 && b <= 7;   // c = true
    printf("c = %d\n", c); // 1
    d = a < 2 || b <= 7;   // d = true
    printf("d = %d\n", d); // 1
    e = !a;                // e = false
    printf("e = %d\n", e); // 0

    /************************
 대입 연산자
************************/

    printf("\n# 대입 연산자\n");

    a = 10, b = 3, c = 1;
    a *= (b - 1);                              // 10 * 2 = 20
    b /= 2 + 3;                                // 3 / 5 = 0
    c += 2;                                    // 1 + 2 = 3
    printf("a = %d b = %d c = %d\n", a, b, c); // 20, 0, 3

    /************************
 조건 연산자
************************/

    printf("\n# 조건 연산자\n");

    a = 10, b;
    b = (a > 15) ? (a + 1) : (a - 1); // false => (a-1)
    printf("b = %d\n", b);            // 9

    /************************
 비트 연산자
************************/

    printf("\n# 비트 연산자\n");

    x = 2;                         // 00000001 = 2 -> 00000100 = 8
    printf("x<<2 = %d\n", x << 2); // 8

/************************
 기타 연산자
************************/

    printf("\n# 기타 연산자\n");

    float float_A = 3.14;
    printf("int형의 크기는=%d바이트\n", sizeof(int));
    printf("float형 변수 a의 크기는=%d바이트\n", sizeof(float_A));
    printf("b = %d\n", b);

    a = 3, b = 4;
    double double_c;
    double_c = (double)a / b;
    printf("\n(double)a / b 나눗셈 결과 : %f\n", double_c);

/************************
 연산자 우선순위
************************/

    printf("\n# 연산자 우선순위\n");

    a=10;b=20;c=30;
    printf("a+b*c=%d\n",a+b*c); // 610
    a=10;b=20;c=30;
    printf("a=b+=2*c->a=%d\n",a=b+=2*c); // 80
    a=10;b=20;c=30;
    printf("a=(b>c)?b:c->a=%d\n",a=(b>c)?b:c); // 30
    a=10;b=20;c=30;
    printf("a/b*c=%d\n",a/b*c); // 0
    a=10;b=20;c=30;
    printf("a*=b=c+5->a=%d\n",a*=b=c+5); //350

    
}
